# Привіт ! Давайте створимо нашу першу програму на Ruby, класичну програму "Hello World". Для цього ми використаємо вбудований метод puts.

#!/usr/bin/ruby
puts "Hello World"

# Цей код виведе на екран текст "Hello World".

# Заповніть пропуски, щоб надрукувати напис "Ruby is fun" на екрані.
puts "Ruby is fun"

# Ще одним методом, який можна використати для виведення результатів на екран, є метод print.
print "Hello World"

# Цей код виводить той самий результат, що і попередній, за винятком того, що команда puts автоматично додає новий рядок після виводу, а команда print цього не робить.
puts "Hi"
print "there"
print "Ruby"
# Результат:
# Hi
# thereRuby

# Коментарі - це рядки приміток у коді Ruby, які ігноруються під час виконання програми. У Ruby для створення однорядкового коментаря використовується символ хештегу.
# Ви також можете створювати багаторядкові коментарі. Все, що знаходиться між зарезервованими словами =begin і =end, вважається коментарем:
=begin
	This comment
	spans multiple 
	lines
=end
puts "Hello"
